// 常用正则表达式

// 数字：^[0-9]*$

// n位的数字：^\d{n}$

// 至少n位的数字：^\d{n,}$

// m-n位的数字：^\d{m,n}$


// 汉字：^[\u4e00-\u9fa5]{0,}$

// 英文和数字：^[A-Za-z0-9]+$ 或 ^[A-Za-z0-9]{4,40}$

// 长度为3-20的所有字符：^.{3,20}$

// 由26个英文字母组成的字符串：^[A-Za-z]+$

// 由26个大写英文字母组成的字符串：^[A-Z]+$

// 由数字和26个英文字母组成的字符串：^[A-Za-z0-9]+$

// 由数字、26个英文字母或者下划线组成的字符串：^\w+$ 或 ^\w{3,20}$

// 中文、英文、数字包括下划线：^[\u4E00-\u9FA5A-Za-z0-9_]+$



// Email地址：^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$

// 域名：[a-zA-Z0-9][-a-zA-Z0-9]{0,62}(/.[a-zA-Z0-9][-a-zA-Z0-9]{0,62})+/.?

// 手机号码：^(13[0-9]|14[5|7]|15[0|1|2|3|5|6|7|8|9]|18[0|1|2|3|5|6|7|8|9])\d{8}$

// 电话号码("XXX-XXXXXXX"、"XXXX-XXXXXXXX"、"XXX-XXXXXXX"、"XXX-XXXXXXXX"、"XXXXXXX"和"XXXXXXXX)：^(\(\d{3,4}-)|\d{3.4}-)?\d{7,8}$

// 国内电话号码(0511-4405222、021-87888822)：\d{3}-\d{8}|\d{4}-\d{7}

// 身份证号(15位、18位数字)：^\d{15}|\d{18}$

// 短身份证号码(数字、字母x结尾)：^([0-9]){7,18}(x|X)?$ 或 ^\d{8,18}|[0-9x]{8,18}|[0-9X]{8,18}?$

// 帐号是否合法(字母开头，允许5-16字节，允许字母数字下划线)：^[a-zA-Z][a-zA-Z0-9_]{4,15}$

// 密码(必须包含大小写字母和数字的组合，不能使用特殊字符，长度在8-10之间)：^(?=.*\d)(?=.*[a-z])(?=.*[A-Z]).{8,10}$

// 日期格式：/^\d{4}-\d{1,2}-\d{1,2}/

// 空白行的正则表达式：\n\s*\r (可以用来删除空白行)

// 中国邮政编码：[1-9]\d{5}(?!\d) (中国邮政编码为6位数字)

// IP地址：\d+\.\d+\.\d+\.\d+ (提取IP地址时有用)