
export default {
  name: 'Home',
  template: `<div>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
               <p>我是标题</p>
             </div>`
};
